[
  {
    "id": "fbb2de95-adad-4897-97ed-0a8f11547bd9",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Absolute Radiance",
    "description_1": "The light, forgotten. ",
    "location": "The Radiance's fight can be accessed by using the Dream Nail on the Hollow Knight in the Temple of the Black Egg.",
    "health": [
      "Stages 1/2/3/4/6 respectively:",
      "400/450/300/750/281",
      "Total: 2181"
    ],
    "lore": "The Radiance is a higher being of light similar to Essence, and as such, opposed to the Void, her ancient enemy. The Moth Tribe is born from her light and in return revered her.",
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Absolute_Radiance/Absolute_Radiance.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "The plague, the infection, the madness that haunts the corpses of Hallownest... the light that screams out from the eyes of this dead Kingdom. What is the source? I suppose mere mortals like myself will never understand.",
    "dlc": "Godmaster"
  },
  {
    "id": "d9af1868-cd9a-4f6f-8490-b47078f65074",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Brooding Mawlek",
    "description_1": "Ferocious but extremely social creature. Becomes aggressive if not able to mingle with its own kind.",
    "location": "The Brooding Mawlek in the Forgotten Crossroads is found beyond a wall jump section in a blocked room to the left of the vertical shaft filled with Gruzzers and Tiktiks. It is possible to reach by Nail-bouncing on the spikes, although it is recommended to have obtained the Mantis Claw instead. Another Brooding Mawlek can be fought in the Colosseum of Fools as part of the Trial of the Fool.",
    "health": [
      "300"
    ],
    "lore": null,
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Brooding_Mawlek/Brooding_Mawlek_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Brooding_Mawlek/Brooding_Mawlek_2.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "I hear this beast crying out sometimes as I prowl the caverns, although I've never actually laid eyes on it. Who or what is it calling for? As far as I can tell, its voice is never answered. ",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "2131a8b8-3c48-4b74-86bf-032e5256e5ef",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Broken Vessel",
    "description_1": "Shattered corpse, reanimated by infected parasites. ",
    "location": "Broken Vessel can be found near the far west corner of the Ancient Basin, guarding the Monarch Wings Ability.",
    "health": [
      "525"
    ],
    "lore": "Broken Vessel is one of the many Vessels who escaped the Abyss like the Knight, but unlike the Knight, was met with a tragic death while still in Hallownest. Its corpse sat in a windy cave deep within the Ancient Basin, in an Infection-filled room just before the Monarch Wings.",
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Broken_Vessel/Broken_Vessel_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Broken_Vessel/Broken_Vessel_2.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Broken_Vessel/Broken_Vessel_3.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Broken_Vessel/Broken_Vessel_4.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "The shape of this creature... I have seen something like it before. More than once, perhaps. It looks a little like the bugs of Hallownest, but not quite the same. Where did these empty little wanderers come from? ",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "8512599c-c720-447c-92bf-3ff42fed6c05",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Dung Defender",
    "description_1": "Skilled combatant living at the heart of the Waterways. Assails intruders with balls of compacted dung.",
    "location": "Dung Defender is located in the east part of the Royal Waterways.",
    "health": [
      "700",
      "750",
      "800",
      "850",
      "900"
    ],
    "lore": "The Dung Defender used to be known as Ogrim, the most loyal of the Five Great Knights of Hallownest. As such, he participated in many battles and adventures. He was also equally renowned for his bad scent, although that did not keep him from enjoying the company of the White Lady and his fellow knights. He was particularly fond of the knight Isma. Ogrim survived the Infection but isolated himself in a part of the Royal Waterways where refuse gathers. There, as the Dung Defender, he guards the pump control that allows entry to Isma's Grove on the other side of the sewers. The Dung Defender defies any who would enter the place to challenge him. He also passes time by rolling dung around and moulding statues out of it. The Dung Defender seems unaware of the fate of his king and the other knights. In his isolation, he deludes himself into thinking they will return and that Hallownest can be reborn.",
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Dung_Defender/Dung_Defender_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Dung_Defender/Dung_Defender_2.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Dung_Defender/Dung_Defender_3.webp"
    ],
    "has_nail_upgrades": true,
    "description_2": "Fighting for 'honour', or for 'loyalty'... you may as well be fighting for dust. If you want to kill, do it for your own sake. That is the nature of a true Hunter.",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "8014e9c4-e459-4f84-84ce-237e93d2e7d9",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Elder Hu",
    "description_1": "Lingering dream of a fallen warrior. Travelled the world tending to those affected by the plague.",
    "location": "Elder Hu is found in the eastern part of Fungal Wastes not too far away from the entrance to the Mantis Village and the City of Tears. ",
    "health": [
      "250",
      "420",
      "550",
      "600",
      "650"
    ],
    "lore": "Elder Hu was a travelling sage who sought to purify the borderlands of Hallownest from the Infection. He reached the Mantis Village, but his own Infected mind made him see the Mantis Lords and the Tribe as afflicted by the plague. The Mantises killed him after he attacked them. A memorial was erected in his name above the gates to the City of Tears, his tunic and bead necklace resting on top of it.",
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Elder_Hu/Elder_Hu_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Elder_Hu/Elder_Hu_2.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Elder_Hu/Elder_Hu_3.webp"
    ],
    "has_nail_upgrades": true,
    "description_2": "Never forget what once was lost, yet do not let it tie you down.  - Elder Hu",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "1fb8a3e1-f237-4653-88a4-fbecc89546ad",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Brothers Oro & Mato",
    "description_1": "Brothers of the nail, trained in combat by the Great Nailsage. ",
    "location": "They sit at the top of the Pantheon of the Master in Godhome.",
    "health": [
      "500 (Oro, First Phase)",
      "600 + 1000 (Oro + Mato, Second Phase)",
      "Total: 2100"
    ],
    "lore": null,
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Brothers_Oro_and_Mato/Oro_and_Mato_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Brothers_Oro_and_Mato/Oro_and_Mato_2.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "\"Gods by toil and nail bound, Brothers sworn to guard the weak, Masters of the sacred ground, Help Us find the God We seek!\"  - Prayer to the Masters",
    "dlc": "Godmaster"
  },
  {
    "id": "d9a5887d-5cc2-47de-ae4e-921f79a7b46b",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Paintmaster Sheo",
    "description_1": "Skilled and respected master of the nail. Always eager to learn new things.",
    "location": "He sits at the top of the Pantheon of the Artist in Godhome.",
    "health": [
      "950"
    ],
    "lore": null,
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Paintmaster_Sheo/Paintmaster_Sheo_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Paintmaster_Sheo/Paintmaster_Sheo_2.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Paintmaster_Sheo/Paintmaster_Sheo_3.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "\"O God inspired, master of arts, Whose works shall eternal endure, Peer beyond Our minds and hearts, Reveal to Us the God most pure!\" - Prayer to the Artist",
    "dlc": "Godmaster"
  },
  {
    "id": "f01ce9f0-a038-4f2a-ad84-59c17a862ad2",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Great Nailsage Sly",
    "description_1": "Legendary sage of the nail arts and, recently, merchant of some success.",
    "location": "He sits at the top of the Pantheon of the Sage in Godhome.",
    "health": [
      "800 (First Phase)",
      "250 (Second Phase)",
      "Total: 1050"
    ],
    "lore": null,
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Great_Nailsage_Sly/Great_Nailsage_Sly_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Great_Nailsage_Sly/Great_Nailsage_Sly_2.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "\"Sagely God of the cunning and bold, Sharpen Our nails and show Us the odds, O greatest of masters, We wish to behold, That one still greater, the God of Gods!\"  - Prayer to the Sage",
    "dlc": "Godmaster"
  },
  {
    "id": "186dd38c-2c64-444f-9560-3643754597af",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Gorb",
    "description_1": "Lingering dream of a fallen warrior. A mysterious life-form that claimed to contain all of the world's knowledge inside of its distended brain.",
    "location": "Gorb's grave is located in the northeast part of the Howling Cliffs.",
    "health": [
      "200",
      "320",
      "416",
      "500",
      "570"
    ],
    "lore": "Gorb the Great Mind was a mystic creature with a distended brain who claimed to be all-knowing. They goaded others to revere their mind and ascend with them to a different plane of existence. Their remains were buried on a hill atop the Howling Cliffs, with a tombstone carved in their image.",
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Gorb/Gorb_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Gorb/Gorb_2.webp"
    ],
    "has_nail_upgrades": true,
    "description_2": "I am Gorb! - Gorb",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "5233d72a-4b24-4cd3-a310-2bb3644062a2",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Flukemarm",
    "description_1": "An insatiable breeder. Has populated the Waterways with its kind. Its insides double as a nest for young Flukefeys.",
    "location": "Flukemarm is located in a hidden area of the Royal Waterways. Desolate Dive/Descending Dark is needed to break the breakable floor which leads to this area. Flukemarm can be found at the end of a tunnel in the southwest. ",
    "health": [
      "350"
    ],
    "lore": "Flukemarm is the mother of all Flukes infesting the Royal Waterways. Her body is used as a nest for young Flukefeys. Like her children, she was Infected and made hostile, although her condition as a breeder prevents her from leaving her cave.",
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Flukemarm/Flukemarm_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Flukemarm/Flukemarm_2.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "The desire to breed, to leave behind a memory of ourselves in the shape of a child... it seems to be etched deep into the heart of every living creature. I too have felt the pull of that base instinct.",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "d9c1cb8d-bfb2-480a-ba35-ee04c1ce41b1",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Galien",
    "description_1": "Lingering dream of a fallen warrior. Trained in the wilds bordering the kingdom, hoping to become a Knight.",
    "location": "Galien's corpse can be found in the west part of Deepnest.",
    "health": [
      "230",
      "368",
      "479",
      "570",
      "640"
    ],
    "lore": "Galien was a brave and undefeated warrior who claimed to be the strongest in Hallownest and desired to prove his valour to the Pale King as a Knight. He travelled to Deepnest in order to test his strength, but eventually found death instead. His husk lies in a cave filled with unusually large glowing mushrooms and a Lifeblood Cocoon, below the Failed Tramway.",
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Galien/Galien_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Galien/Galien_2.webp"
    ],
    "has_nail_upgrades": true,
    "description_2": "A Knight strives not only to protect the land and its people, but the hopes and dreams of the kingdom. - Galien",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "42a02485-fa55-4dc1-aa83-a7dd9c14f62e",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Gruz Mother",
    "description_1": "Mature gruzzer that carries its young in its belly. Attacks by hurling its huge body around.",
    "location": "Gruz Mother can be found in the Forgotten Crossroads, sleeping peacefully until disturbed. Two are fought at once in the Colosseum of Fools, however, they do not spawn Gruzzers upon death. This is also true for the ones fought in the Hall of Gods, Pantheon of the Master, and Pantheon of Hallownest.",
    "health": [
      "90",
      "140 (Trial of the Warrior)"
    ],
    "lore": null,
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Gruz_Mother/Gruz_Mother_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Gruz_Mother/Gruz_Mother_2.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "Bizarrely, this monster does not lay eggs but instead carries its young inside of its fat stomach. This strange practice seems to exhaust the creature, making it sleepy and vulnerable. Take advantage!",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "cac8b371-d054-4621-bd2d-ecaadf236040",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Hive Knight",
    "description_1": "Loyal protector of the Hive's Queen. Flightless but ferocious in battle.",
    "location": "Hive Knight can be found in the eastern part of the Hive.",
    "health": [
      "800",
      "800",
      "800",
      "850",
      "920"
    ],
    "lore": "Hive Knight is the most valiant and skilled knight of the Hive; he is flightless and bound to protect Hive Queen Vespa by the Bees' hive mind. Although the Infection spread to the Hive after the queen died, Hive Knight still protects her, hoping she will one day wake up and revive the Hive.",
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Hive_Knight/Hive_knight_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Hive_Knight/Hive_knight_2.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Hive_Knight/Hive_knight_3.webp"
    ],
    "has_nail_upgrades": true,
    "description_2": "Some creatures are born with duties and loyalties marked indelibly upon their minds. They are strong, but they are also slaves.",
    "dlc": "Lifeblood"
  },
  {
    "id": "4dcc3938-b508-489e-8c1f-c2742d2672c1",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Hornet",
    "description_1": "Skilled protector of Hallownest's ruins. Wields a needle and thread.",
    "location": "Hornet appears in two areas of the game to fight her first she appears in Greenpath as Hornet Protector, then we find her in Kingdom's Edge as Hornet Sentinel.",
    "health": [
      "Protector: 255",
      "Sentinel: 700"
    ],
    "lore": "Hornet is the daughter of the Pale King and Herrah the Beast, the queen of Deepnest. Her birth was the result of a bargain for her mother to become a Dreamer, and as such, she spent only a short time with Herrah. Her shared father with the Knight and the rest of the Vessels makes them siblings. Raised in Deepnest, Hornet survived the Infection and the fall of the kingdom. She wanders its ruins, chasing off travellers who would seek to desecrate them, but also protecting the sealing of the Black Egg. She also guards the Cast-Off Shell in the Kingdom's Edge which can grant the King's Brand, the key to the Abyss. In her duties, she encountered Quirrel in the Howling Cliffs at his arrival in Hallownest. She attempted to fight him but was repelled by the mask of Monomon he wears on his head. Hornet leaves him be after recognizing the mask, knowing that he was called upon, despite him not knowing it. Like Quirrel and the Knight, she sensed the awakening of the Infection and started wandering Hallownest in search of answers. In Hollow Knight, she works to stop the impending doom looming on Hallownest. In Hollow Knight: Silksong, she ends up captured and brought to the haunted kingdom of Pharloom.",
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Hornet/Hornet_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Hornet/Hornet_2.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Hornet/Hornet_3.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "I have seen this nimble little creature. I thought her prey and pounced at her, but with a flash she stabbed me with her flying stinger and darted away. Could she be... a Hunter? ",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "4d4e96cf-d197-4e78-9b5f-36c12e0f84fa",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Pure Vessel",
    "description_1": "Chosen vessel, raised and trained to prime form.",
    "location": "They are the prime version of the Hollow Knight, unaffected by the Infection. They sit at the top of the Pantheon of the Knight.",
    "health": [
      "1600"
    ],
    "lore": null,
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Pure_Vessel/Pure_Vessel_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Pure_Vessel/Pure_Vessel_2.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Pure_Vessel/Pure_Vessel_3.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "\"Deepest silence in holy shell, Given nail and named a Knight, Bound by chain and egg and spell, Hear Our plea! Reveal thy Light!\" - Prayer to the Vessel",
    "dlc": "Godmaster"
  },
  {
    "id": "5e52b7f3-19a1-4058-8b16-beba2dc5d2d9",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "No Eyes",
    "description_1": "Lingering dream of a fallen warrior. Disappeared during the plague.",
    "location": "No Eyes can be found inside of the Stone Sanctuary, in Greenpath.",
    "health": [
      "200",
      "320",
      "416",
      "500",
      "570"
    ],
    "lore": "No Eyes was a warrior of Hallownest who fell to the Infection. She could not sleep knowing the dreams would infect her mind with the light. To protect herself and other bugs, she stripped out both their eyes and her own before succumbing. She was laid to rest in the Stone Sanctuary, a place in complete darkness, and a carved statue was placed upon her grave.",
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/No_Eyes/No_Eyes_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/No_Eyes/No_Eyes_2.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/No_Eyes/No_Eyes_3.webp"
    ],
    "has_nail_upgrades": true,
    "description_2": "They're coming... What's inside of you... Strip it out! - No Eyes",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "20c47cd9-69fc-4502-9e61-cf8a359dc1de",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Oblobbles",
    "description_1": "Larger cousin of the Obble. Pairs with a mate for life and will never leave its side.",
    "location": "The Oblobbles are only found in the Colosseum of Fools and Godhome.",
    "health": [
      "260 + 260 (First Phase)",
      "up to 300 (Second Phase)",
      "Total: 560-620"
    ],
    "lore": null,
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Oblobbles/Oblobble_1.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "Having a mate by your side... one that will never leave you until death. Strange. No mate has ever come forth to stay by my side...",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "75db94bd-e9dd-4def-bb9b-e3f800ee393d",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Uumuu",
    "description_1": "Intelligent being that guards the inner chamber of the Teacher's Archives.",
    "location": "Uumuu is located in the centre of the Teacher's Archives.",
    "health": [
      "300"
    ],
    "lore": "Uumuu is an intelligent yet Infected being similar to the Uomas and Oomas infesting Fog Canyon. It defends Monomon's chamber at the heart of the Teacher's Archives.",
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Uumuu/Uumuu_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Uumuu/Uumuu_2.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "The canyon below us, the one thick with fog and crackling with strange energy... a Hunter can lose their senses down there. Be careful... strange and unnatural things lurk there.",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "cb74c93a-1f2b-4497-8b5a-d004e8e31f0a",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Winged Nosk",
    "description_1": "Mimics the shape of other creatures to lure prey to its lair.",
    "location": "It can be encountered in the Pantheon of Hallownest.",
    "health": [
      "750"
    ],
    "lore": null,
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Winged_Nosk/Winged_Nosk.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "In the deepest darkness, there are beasts who wear faces stolen from your memories and pluck at the strings in your heart. Know yourself, and stay strong.",
    "dlc": "Godmaster"
  },
  {
    "id": "52ab6479-df14-4800-a7cf-e33d57e69a8a",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "White Defender",
    "description_1": "Figure from a fondly remembered past. Reacts gallantly to defeat by becoming stronger.",
    "location": "To reach the White Defender, both the Dung Defender and all three Dreamers have to be defeated first. Use Desolate Dive/Descending Dark on the floor at the far right end of his boss room directly underneath the floating platform to access a hidden room beneath. Here Dung Defender can be found sleeping in the room on the left. Use the Dream Nail on him to enter the dream and initiate combat.",
    "health": [
      "1600"
    ],
    "lore": null,
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/White_Defender/White_Defender_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/White_Defender/White_Defender_2.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/White_Defender/White_Defender_3.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "\"The Champion's Call, the Knotted Grove, the Battle of the Blackwyrm... I remember it all. I will carry those glories with me always... until we meet again.\" - Ogrim of the Five Knights",
    "dlc": "Hidden Dreams"
  },
  {
    "id": "9bd42f28-54f8-4d63-b76d-79975dbbf0ee",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Massive Moss Charger",
    "description_1": "Family of creatures that have learnt to bulk up with moss and live as one.",
    "location": "The Massive Moss Charger is located in the southwest part of Greenpath near Fog Canyon.",
    "health": [
      "100"
    ],
    "lore": null,
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Massive_Moss_Charger/Massive_Moss_Charger_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Massive_Moss_Charger/Massive_Moss_Charger_2.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "There is strength in numbers, yes, but these creatures never had much strength to begin with. Cut through their trickery!",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "99915189-fb73-478e-b270-2eba05c4651e",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Traitor Lord",
    "description_1": "Deposed Lord of the Mantis tribe. Embraced the infection and turned against his sisters.",
    "location": "The Traitor Lord is located in the upper section of the Queen's Gardens, beyond a Shade Gate.",
    "health": [
      "800"
    ],
    "lore": "The Traitor Lord was one of the leaders of the Mantis Tribe along with his sisters, and particularly resented the kingdom of Hallownest. Similarly, he disapproved of the relationship of his daughter with the Grey Mourner due to the Grey Mourner being an outsider. At some point, he and his followers embraced the Infection to become stronger and were cast out from the Mantis Village. They eventually found their way to and settled in the Queen's Gardens. They sought to take the gardens for themselves and chase the White Lady out of her refuge but were pushed back by her protector, the knight Dryya. Despite this failure, the Traitor Lord and the other Mantis outcasts still remained in the gardens, now guided only by a basic territorial and violent instinct. The Traitor Lord's daughter died at a certain point. Her grave can be found in the Queen's Gardens just above the Stag Station, in a cave smothered by vines. Her grave can be seen in the background of his arena in Godhome as well.",
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Traitor_Lord/Traitor_Lord_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Traitor_Lord/Traitor_Lord_2.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Traitor_Lord/Traitor_Lord_3.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "I have felt that desire. The desire to take the infection into myself. To become stronger, more powerful... these thoughts haunt my dreams during the darkest times. A false hope, but it can burn so brilliantly in one's mind.",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "83a8b9d3-bb79-4253-abc3-eef5a9a0afcb",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Nightmare King Grimm",
    "description_1": "Twisted spectre of scarlet flame.",
    "location": "After defeating Troupe Master Grimm, he upgrades the Grimmchild, allowing the Knight to collect another four flames. After collecting three of them, Grimm can be found asleep at the back of the large tent in Dirtmouth. Using the Dream Nail on him while having Grimmchild equipped allows the Knight to enter his nightmare, fight him, and complete the ritual.",
    "health": [
      "1500"
    ],
    "lore": null,
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Nightmare_King_Grimm/Nightmare_King_Grimm_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Nightmare_King_Grimm/Nightmare_King_Grimm_2.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Nightmare_King_Grimm/Nightmare_King_Grimm_3.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "\"The expanse of dream in past was split, One realm now must stay apart, Darkest reaches, beating red, Terror of sleep. The Nightmare's Heart.\" - Seer",
    "dlc": "The Grimm Troupe"
  },
  {
    "id": "cda13932-4f4c-4256-9915-97c8d7072a8c",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "God Tamer",
    "description_1": "Veteran warrior of the Colosseum of Fools. Fights by the side of creatures she has trained.",
    "location": "This boss is only found in the Colosseum of Fools and Godhome.",
    "health": [
      "600 (Tamer)",
      "450 (Beast)",
      "Total: 1050"
    ],
    "lore": "God Tamer is a veteran warrior of the Colosseum of Fools, taking the mantle of boss of the last and most brutal trial. She compensates for her small stature with the strength of her tamed Beast, alongside which she fights. They both present signs of the Infection.",
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/God_Tamer/God_Tamer_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/God_Tamer/God_Tamer_2.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/God_Tamer/God_Tamer_3.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "Some hunters train beasts to join them in chasing down prey. I tried it once, but couldn't resist the urge to test my companion's strength against mine.",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "41264247-9880-45fe-9043-0713bc6fb392",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Grimm",
    "description_1": "Master of the Grimm Troupe.",
    "location": "Grimm is located in Dirtmouth after he has been summoned by the Nightmare Lantern in the Howling Cliffs.",
    "health": [
      "800",
      "800",
      "800",
      "930",
      "1000"
    ],
    "lore": "Grimm is the master of the Grimm Troupe, a mysterious travelling circus. In truth, Grimm and his Troupe travel from the Nightmare Realm to wherever the Nightmare Lantern has been lit by acolytes. They gather Nightmare Flames from ruined lands to fuel the sinister being enslaving the Troupe, the Nightmare's Heart. Their ritual to feed the Nightmare's Heart consists of feeding first a Grimmchild with Nightmare Flames. They then slay the Nightmare King for it to be reborn anew through the Grimmchild.",
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Grimm/Grimm_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Grimm/Grimm_2.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Grimm/Grimm_3.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Grimm/Grimm_4.webp"
    ],
    "has_nail_upgrades": true,
    "description_2": "\"Through dream I travel, at lantern's call, To consume the flames of a kingdom's fall.\" - Grimm",
    "dlc": "The Grimm Troupe"
  },
  {
    "id": "fa8d78a8-9118-4d9e-b396-049c222b4415",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Grey Prince Zote",
    "description_1": "Figment of an obsessed mind. Lacks grace but becomes stronger with every defeat.",
    "location": "To access Grey Prince Zote, both Bretta and Zote must have been saved and Zote must have been defeated in the Colosseum of Fools. The Monarch Wings are also needed for the basement to open. The fight starts by striking the statue in Bretta's basement with the Dream Nail.",
    "health": [
      "1200-1500",
      "(+100 per fight for the first 4 fights)"
    ],
    "lore": null,
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Grey_Prince_Zote/Grey_Prince_Zote_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Grey_Prince_Zote/Grey_Prince_Zote_2.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Grey_Prince_Zote/Grey_Prince_Zote_3.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Grey_Prince_Zote/Grey_Prince_Zote_4.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "\"My love, any creature who could bear to be away from you, who would willingly leave you behind or say unkind things to you... Pah! Lowly maggots, not worthy of standing in your glorious shadow!\" She felt her cold body grow warm, a sensation she had almost forgotten... - \"The Grey Prince\" Chapter 112",
    "dlc": "Hidden Dreams"
  },
  {
    "id": "0d4cc96b-797f-4d90-82c8-686351409f99",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Vengefly King",
    "description_1": "Patriarch of a vengefly colony. Swoops at intruders and cries out for reinforcements if threatened.",
    "location": "The Vengefly King is first encountered in the northern part of Greenpath. It can also be fought in the Trial of the Warrior at the Colosseum of Fools.",
    "health": [
      "55",
      "100 (Trial of the Warrior)"
    ],
    "lore": null,
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Vengefly_King/Vengefly_King_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Vengefly_King/Vengefly_King_2.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "A filthy creature that is happy to chew on any old thing it finds discarded on the cavern floor. When it notices a threat it will annoyingly scream and shriek, so kill it swiftly.",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "9777c5b8-d473-410c-ac9b-0069e85a9ab8",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Mantis Lords",
    "description_1": "Leaders of the Mantis tribe and its finest warriors. They bear thin nail-lances and attack with blinding speed.",
    "location": "The area that the Mantis Lords are located in can be accessed after obtaining the Mantis Claw and activating a lever in the northeast part of the Mantis Village.",
    "health": [
      "210 (First Phase)",
      "160 + 160 = 320 (Second Phase)",
      "Total: 530"
    ],
    "lore": "The Mantis Lords are three sisters who lead the Mantis Tribe deep within the Fungal Wastes. They managed to resist the Infection throughout Hallownest despite the exile of their brother and his followers, who chose to accept the Infection willingly. The Mantis Lords have kept the beasts of Deepnest confined to their territory, killing those who would intrude upon the village. This duty was part of a truce with the Kingdom, maintained even as it fell to ruins. Yet the Mantis Lords, like the rest of their Tribe, remain proud warriors. They grant passage into Deepnest to any who would defeat them in a fair challenge, in an improvised arena in their throne room.",
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Mantis_Lords/Mantis_Lords_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Mantis_Lords/Mantis_Lords_2.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "The Mantis tribe and the bugs of old Hallownest had no love for each other. The Mantises outlived their rivals though, and their civilisation still stands.",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "fa444712-f0fd-4132-b5af-725df7d77f76",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Marmu",
    "description_1": "Lingering dream of a fallen warrior. Protector of the Queen's Gardens.",
    "location": "Marmu is located in the Queen's Gardens, west of the Stag Station.",
    "health": [
      "200",
      "320",
      "416",
      "500",
      "570"
    ],
    "lore": "Marmu was the innocent-minded yet strong protector of the Queen's Gardens. The Queen promised to teach her how to fly upon her return to the verdant retreat. Marmu passed away before that day and a totem in her memory was placed upon her grave in the gardens' wilds.",
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Marmu/Marmu_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Marmu/Marmu_2.webp"
    ],
    "has_nail_upgrades": true,
    "description_2": "If you believe in something as hard as you can, with your eyes shut tight... eventually it will come true! - Marmu",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "99300f77-49e6-4bd1-b1dc-62ca913bd51b",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "The Collector",
    "description_1": "Dark figure locked inside the Tower of Love. Preserves Hallownest's creatures in glass jars with particular attention given to Grubs.",
    "location": "The Collector is locked in the Tower of Love, which can only be accessed using the Love Key, found in the Queen's Gardens. The Tower can only be entered from the deep lift shaft between Kingdom's Edge and the City of Tears. An exit to King's Station can be accessed after flipping a switch.",
    "health": [
      "750",
      "750",
      "750",
      "800",
      "850"
    ],
    "lore": "The Collector is a Void creature. It lives hidden away in the locked Tower of Love along with a large collection of bugs from throughout Hallownest that are preserved, both dead and alive, in glass jars. While always displaying a joyous demeanour, the Collector is only concerned with the preservation of other creatures.It trapped the Grubs from the Forgotten Crossroads colony and recorded their location throughout Hallownest on a map. Despite its attention to the Grubs, it only has three within its tower. It also has a connection to the previous owner of the key to the tower, a Hallownest aristocrat bug that can be found dead deep within the Queen's Gardens.",
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/The_Collector/The_Collector_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/The_Collector/The_Collector_2.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/The_Collector/The_Collector_3.webp"
    ],
    "has_nail_upgrades": true,
    "description_2": "A shadow that sometimes flits through the caverns, making strange noises to itself. I've never seen it clearly so I have no idea what type of creature it is.",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "67c294c8-4b5c-4b28-b034-1074732a3cf2",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Xero",
    "description_1": "Lingering dream of a fallen warrior. Executed for crimes against the King.",
    "location": "Xero can be found in the west part of the Resting Grounds.",
    "health": [
      "200",
      "320",
      "416",
      "500",
      "570"
    ],
    "lore": "Xero was a warrior of Hallownest who believed that strength would always allow him a bright future. When his mind was infected, he hoped to fight against the plague with violence. Fueled by the same hope, he turned against the Pale King, for which he was executed. Xero was buried in the Resting Grounds, his tomb a reminder to any who would betray the King. When his spirit awoke, he still could not see the wrongness of his actions and instead believed his demise was the result of a doomed fate.",
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Xero/Xero_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Xero/Xero_2.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Xero/Xero_3.webp"
    ],
    "has_nail_upgrades": true,
    "description_2": "A life defined by tragedy and triumph. A death marred by sorrow and regret. A spirit burdened by sins and memories. Better to wander the world than be cursed with glory. - Xero",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "6ef8e89a-e268-4eff-a8ec-28c71ea45bab",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Hollow Knight",
    "description_1": "Fully grown Vessel, carrying the plague's heart within its body.",
    "location": "The Hollow Knight is located in the Temple of the Black Egg which can be opened after all three Dreamers have been killed.",
    "health": [
      "Phases 1-3 respectively:",
      "250/350/400",
      "Total: 1000",
      "+ 250 (Heals for Fourth Phase)",
      "Final Total: 1250"
    ],
    "lore": "The Hollow Knight is the Vessel chosen by the Pale King to seal away the Radiance and save Hallownest from the Infection. Like their siblings, they are the child of the King and Queen of Hallownest, birthed in the Abyss to be infused with the power of the Void. As such, they are genderless. This birth condition was also supposed to leave them without a mind, will, and voice, to prevent the Radiance from influencing them. However, their purity was misjudged, tarnished by an idea instilled, a bond with the Pale King who raised them. The young Hollow Knight being led out of the Abyss Regardless of their impurity, the Hollow Knight was trained and raised, eventually becoming a fully grown Vessel. The Radiance was sealed within them, and they were chained within the Temple of the Black Egg where they were expected to contain the Infection for eternity. However, because of the aforementioned impurities, the Radiance could still exert influence. It ultimately resulted in the resurgence of the Infection and the Kingdom falling into ruin. Over time, the Hollow Knight disappeared from the fallen Kingdom's memory. Only the Memorial in the middle of the City of Tears testifies of their sacrifice to save Hallownest. After some time, the Radiance's power broke out of the Hollow Knight, cracking their shell and fully Infecting them. This event was the catalyst that brought the Knight back to Hallownest. The Knight can free and fight the Hollow Knight after killing the three Dreamers who sealed the Black Egg's entrance.",
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Hollow_Knight/Hollow_Knight_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Hollow_Knight/Hollow_Knight_2.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Hollow_Knight/Hollow_Knight_3.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Hollow_Knight/Hollow_Knight_4.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Hollow_Knight/Hollow_Knight_5.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "The old King of Hallownest... he must have been desperate to save his crumbling little world. The sacrifices he imposed on others... all for nothing.",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "90686e6c-9b3e-44d1-84f6-1d2f3e7c4df2",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Markoth",
    "description_1": "Lingering dream of a fallen warrior. Only member of his forgotten tribe to take up a weapon.",
    "location": "In order to reach the location, the Shade Cloak is needed to bypass the Shade Gate before Markoth's room.",
    "health": [
      "250",
      "400",
      "520",
      "624",
      "705"
    ],
    "lore": "Markoth was the only moth to carry a weapon besides Thistlewind. He went to Kingdom's Edge to seclude himself and meditate, hoping to uncover a truth long forgotten. Markoth fought any who would threaten him, regardless of their reasons. He eventually died, his remains never to be found, in a lone cave of Kingdom's Edge.",
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Markoth/Markoth_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Markoth/Markoth_2.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Markoth/Markoth_3.webp"
    ],
    "has_nail_upgrades": true,
    "description_2": "May your efforts lead you somewhere worthy. - Markoth",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "d6ede603-4052-47f4-9f64-f5d5f0ad047f",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Nosk",
    "description_1": "Mimics the shape of other creatures to lure prey to its lair.",
    "location": "A breakable wall in the room directly west of the Deepnest Hot Spring reveals a secret section containing a Grub. Breaking another wall behind the Grub leads to the tunnels and into Nosk's lair. Either the Monarch Wings or Crystal Heart is required to access the hidden room.",
    "health": [
      "680"
    ],
    "lore": "Nosk is a mysterious, shape-shifting, Infected beast hunting throughout Deepnest. It can mimic the shape of faces it finds in the memories of bugs, usually loved or departed ones, and can contort its body to assume a smaller frame. It hangs its prey, including Dirtcarvers, a Stalking Devout, and various Vessels, from the ceiling of its lair at the bottom of Deepnest.",
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Nosk/Nosk_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Nosk/Nosk_2.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "In the deepest darkness, there are beasts who wear faces stolen from your memories and pluck at the strings in your heart. Know yourself, and stay strong.",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "2a0bddba-c590-45d1-996b-98f61aa9b079",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Radiance",
    "description_1": "The light, forgotten.",
    "location": "The Radiance's fight can be accessed by using the Dream Nail on the Hollow Knight in the Temple of the Black Egg.",
    "health": [
      "Stages 1/2/3/4 respectively:",
      "350/400/250/700",
      "Total: 1700"
    ],
    "lore": "The Radiance is a higher being of light similar to Essence, and as such, opposed to the Void, her ancient enemy. The Moth Tribe is born from her light and in return revered her.",
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Radiance/Radiance_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Radiance/Radiance_2.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Radiance/Radiance_3.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Radiance/Radiance_4.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "The plague, the infection, the madness that haunts the corpses of Hallownest... the light that screams out from the eyes of this dead Kingdom. What is the source? I suppose mere mortals like myself will never understand.",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "789190da-f59c-4a9c-8290-d23bdd9df306",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Watcher Knight",
    "description_1": "Discarded shell of a Watcher Knight, re-animated by a swarm of infected flies.",
    "location": "The Watcher Knights are located near the top of Watcher's Spire.",
    "health": [
      "6 x 220/220/220/240/260",
      "Total: 1320/1320/1320/1440/1560"
    ],
    "lore": "The Watcher Knights used to defend the entrance to the Watcher's Spire and Lurien's dormant body. They eventually died while standing guard, leaving their shells behind.",
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Watcher_Knight/Watcher_Knight_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Watcher_Knight/Watcher_Knight_2.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Watcher_Knight/Watcher_Knight_3.webp"
    ],
    "has_nail_upgrades": true,
    "description_2": "When these silent warriors fall in battle, their bodies split open and strange bugs come flying out. I wonder, what will come flying out of me when I die? Will my hopes and fears drift away into the darkness?",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "cc3c8b19-c583-447f-a172-640c31861b10",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Zote",
    "description_1": "A self-proclaimed Knight, of no renown. Wields a nail he carved from shellwood, named 'Life Ender.' ",
    "location": "Zote can be found in several places in Hallownest after being saved on Greenpath, then we find him in Dirtmouth, then we meet him in City of Tears, then we rescue him in Deepnest and fight a grueling battle with him in Colosseum of Fools.",
    "health": [
      "200"
    ],
    "lore": "Zote is a traveller from outside Hallownest who came to the Kingdom to fulfill a promise. This is ultimately revealed to be a promise of glory for himself. He named his nail \"Life Ender\" because names supposedly have power. Unfortunately, because it is made of shellwood, it cannot deal damage. While he claims to be the strongest warrior in the land, he is found trapped by weak enemies or claiming the glory of another bug's deeds. He regards the Knight as beneath him and accuses them of constantly getting in his way.",
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Zote/Zote_2.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Zote/Zote_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Zote/Zote_3.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "Some rare creatures are so weak, so helpless, so inept and so irritating that hunting them gives no pleasure.",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "96122cf4-ab05-496b-9d97-e1b8f03040e3",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Crystal Guardian",
    "description_1": "Heavyset miner of the Crystal Peak overcome by crystal growth. Can discharge blazing beams of light from its crystalllised limbs.",
    "location": "The Crystal Guardian can be encountered for the first time in the Bench room in the centre of Crystal Peak. ",
    "health": [
      "280"
    ],
    "lore": "The Crystal Guardian is part of the miners of Crystal Peak who died from the Infection and were reanimated by it. It appears larger than the other husks, has crystal growing on its back and encasing both its arms and its head. It also has more mastery over the crystal's light than the Crystallised Husks. While encased in crystal, the Guardian shrieks similarly to the Radiance although at a higher pitch. When cleared of the crystal, it has a normal bug voice. Like the other miner husks, it is obsessed with the light but has grown too tired to mine it relentlessly as they do.",
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Crystal_Guardian/Crystal_Guardian_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Crystal_Guardian/Crystal_Guardian_2.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Crystal_Guardian/Crystal_Guardian_3.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "How does the world look to this creature, gazing out from within its crystal prison? Does it see only light? Is that what drives it into a frenzy? ",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "f5155827-df65-4305-a2f3-d0d6cd6ddbd8",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "False Knight",
    "description_1": "A maggot driven mad by a strange force. Inhabits a stolen armoured shell.",
    "location": "False Knight is located in the centre of the Forgotten Crossroads. ",
    "health": [
      "65 (Armour)",
      "40 (Maggot)",
      "Minimum total to kill:",
      "3 armour stages (65x3) + 4 head stages (40x4)",
      "Total: 355"
    ],
    "lore": "False Knight is a Maggot wearing the armour of Hegemol, one of the Five Great Knights of Hallownest. This weak creature wanted to find means to protect his siblings who live in an abandoned storeroom in the middle of the Forgotten Crossroads. When he discovered Hegemol sleeping in his armoured shell, he took it for himself, hoping for the great strength that wearing the armour seemed to promise. Even though madness did not drive him to do this, False Knight eventually fell to the Infection's control.",
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/False_Knight/False_Knight_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/False_Knight/False_Knight_2.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "Weak creatures love to steal the strength of others. Their lives are brief and fearful, and they yearn to have the power to dominate those who have dominated them.",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "f7290c3b-058c-44ea-99b6-09d526ef484c",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Soul Master",
    "description_1": "Head of the Soul Sanctum. Hoarded soul hoping to stave off Hallownest's affliction, but eventually became intoxicated by its power.",
    "location": "Soul Master is located in the upper part of Soul Sanctum.",
    "health": [
      "275 (First Phase)",
      "110 (Second Phase)",
      "Total: 385"
    ],
    "lore": "Soul Master is the leader of the Soul Sanctum of Hallownest, which searched for ways to expand the minds of bugs and attain pure focus. When the Infection started, he came to the conclusion that Soul, the energy animating bugs and beasts alike, was the solution to cure their mind of this plague. He refused to listen to the Pale King opposing his work, and failed to realise that his own Infected mind was influencing him. Soul Master hoarded Soul and consumed it, eventually gaining new Soul powers. He had Soul Totems gathered in the Sanctum and drained many unfortunate bugs of their vital energy. Unlike the rest of the Kingdom's inhabitants, he and his followers were able to survive the Infection. However, he was driven to obsession in his quest for immortality, and lost his sanity while trying to get closer to the light that was guiding him in his mind.",
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Soul_Master/Soulmaster_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Soul_Master/Soulmaster_2.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Soul_Master/Soulmaster_3.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "The bugs of Hallownest tried all kinds of tricks and rituals and prayers to rid themselves of the infection. But to no avail! Perhaps the infection came from somewhere deep inside of them that they could not escape.",
    "dlc": "Hunter's Journal"
  },
  {
    "id": "70ea8d5a-11ec-4f60-a568-7f24d817bb64",
    "created_at": "2024-06-10 18:01:59.352753+00",
    "boss": "Soul Warrior",
    "description_1": "Learned bug, wielding a refined pinblade. Enhances its combat prowess with harvested soul.",
    "location": "Two Soul Warriors are fought in the Soul Sanctum, one of them guards the Shade Soul Spell. Two more are fought during the Trial of the Fool in the Colosseum of Fools.",
    "health": [
      "180",
      "300 (Elegant Key Room)"
    ],
    "lore": "Soul Warriors are scholars who enhanced their combat abilities with stolen Soul. Unlike the other scholars in the sanctum, they seem to have a very hazy grasp of their own memories and the origins of their powers.",
    "images": [
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Soul_Warrior/Soul_Warrior_1.webp",
      "https://txnrptehfdvtpboqdkvf.supabase.co/storage/v1/object/public/Images/Bosses/Soul_Warrior/Soul_Warrior_2.webp"
    ],
    "has_nail_upgrades": false,
    "description_2": "Where these strange warriors go, whispers follow them. Not only are they skilled with a nail, they can also use some strange power to shift suddenly from place to place. Stay on guard.",
    "dlc": "Hunter's Journal"
  }
]